#include "numbook.h"

void PrintNumBook(struct base* nowBook, int lineCount) { // 전화번호부의 목록 출력 
    printf("%s", "======= 03. 출력 ======= \n");
    printf("... 무엇을 출력 하시겠습니까? \n01. 전체 전화번호부 출력\n02. 긴급 연락처 출력\n");
    int key = rightkey(2); // 잘 입력했는지 검사하는 함수 
    if (key == 1) { // 전체 전화번호부 출력을 입력했을때 
        int i = 0;
        printf("===============================================================================================================\n");
        printf("%-5s %-20s %-20s %-20s %-20s %-20s\n", "번호", "이름", "전화번호", "관계", "메일", "긴급연락처 등록 여부"); 
        printf("---------------------------------------------------------------------------------------------------------------\n");
        for (i = 0; i < lineCount; i++) {  // 반복문을 이용하여 줄 수 만큼 전화번호부를 출력함 
            printf("%-5d %-20s %-20s %-20s %-20s %-20s\n", i + 1, nowBook[i].name, nowBook[i].num, nowBook[i].relation, nowBook[i].mail, nowBook[i].sos);
        }
        printf("===============================================================================================================\n");
        printf("%s %d %s","... 총 ", lineCount, " 항목 출력\n");
        if (i == 0) { // 만약에 출력된 전화번호부가 없으면, 연락처가 없다고 출력함 
            printf("\n... 전화번호부에 연락처가 없습니다. \n");
        }
    }
    else if (key == 2) { // 긴급 연락처 출력을 입력했을 때 
        int num = 0;
        printf("===============================================================================================================\n");
        printf("%-5s %-20s %-20s %-20s %-20s %-20s\n", "번호", "이름", "전화번호", "관계", "메일", "긴급연락처 등록 여부");
        printf("---------------------------------------------------------------------------------------------------------------\n");
        for (int i = 0; i < lineCount; i++) {
            if (strcmp(nowBook[i].sos, "O") == 0) { // 긴급 연락처에 'O' 표시가 있는 연락처만 출력함 
                num++;
                printf("%-5d %-20s %-20s %-20s %-20s %-20s\n", num, nowBook[i].name, nowBook[i].num, nowBook[i].relation, nowBook[i].mail, nowBook[i].sos);
            }
            
        }
        printf("===============================================================================================================\n");
        printf("%s %d %s", "... 총 ", num, " 항목 출력\n");
        if (num == 0) {  // 만약에 연락처가 없으면 연락처가 없다고 표시함 
            printf("\n... 전화번호부에 저장된 긴급 연락처가 없습니다. \n");
        }

    }
}